/* Заполнение таблиц небольшим количеством данных */
INSERT INTO "Supply" ("Customer_name", "Address", "Comment") VALUES
    ('Кизляров Евгений Вадимович', '{"street": "улица Строителей", "building": "4к3"}'::json, 'Приму в любое время'),
    ('Кизляров Евгений Вадимович', '{"street": "улица Удальцова", "building": "22"}'::json, 'Прошу привезти как можно быстрее'),
    ('Филатенко Иван Петрович', '{"street": "улица Академика Анохина", "building": "56"}'::json, NULL),
    ('Филатенко Иван Петрович', '{"street": "улица Сёрегина", "building": "41"}'::json, 'Нужна доставка без повреждений'),
    ('Ильин Петр Васильевич', '{"street": "улица Берзарина", "building": "10"}'::json, 'Приму в любое время в течение дня'),
    ('Прохоренко Николай Витальевич', '{"street": "улица Летная", "building": "72"}'::json, 'Срочно нужно, привезите быстрее');

INSERT INTO "Product" ("Product_name", "Measure") VALUES
    ('Пассатижи', 'шт'),
    ('Отвертка крестовая', 'шт'),
    ('Отвертка плоская', 'шт'),
    ('Цемент', 'кг'),
    ('Краска белая', 'л'),
    ('Краска зеленая', 'л'),
    ('Уровень', 'шт');

INSERT INTO "Company" ("Store_name", "City", "Address") VALUES
    ('Стройлон', 'Москва', '{"street": "Шарикоподшипниковская улица", "building": "15"}'::json),
    ('Мегастрой', 'Москва', '{"street": "Красноармейская улица", "building": "18"}'::json),
    ('Стройлон', 'Москва', '{"street": "Хорошиловский проезд", "building": "25"}'::json),
    ('Мегастрой', 'Москва', '{"street": "Беговая улица", "building": "18"}'::json);

INSERT INTO "Date" ("Full_date", "Year", "Quarter", "Month", "Day") VALUES
    ('2020-01-01'::date,2020, 1, 1, 1),
    ('2020-01-16'::date,2020, 1, 1, 16),
    ('2020-03-04'::date,2020, 1, 3, 4),
    ('2020-03-07'::date,2020, 1, 3, 7),
    ('2020-05-12'::date,2020, 2, 5, 12),
    ('2020-05-18'::date,2020, 2, 5, 18),
    ('2020-08-15'::date,2020, 3, 8, 15),
    ('2020-09-02'::date,2020, 3, 9, 2),
    ('2020-10-24'::date,2020, 4, 10, 24),
    ('2020-12-30'::date,2020, 4, 12, 30);

INSERT INTO "Fact" ("Store_ID", "Supply_ID", "Product_ID", "Date_ID", "Amount") VALUES
    (1, 1, 2, 1, 1),
    (1, 2, 3, 2, 2),
    (1, 3, 4, 3, 4),
    (1, 4, 5, 4, 1),
    (1, 5, 6, 5, 2),
    (1, 6, 7, 6, 1),
    (1, 1, 1, 7, 1),
    (2, 2, 2, 8, 3),
    (2, 3, 3, 9, 1),
    (2, 4, 4, 10, 1),
    (2, 5, 5, 1, 2),
    (2, 6, 6, 2, 1),
    (2, 1, 7, 3, 3),
    (2, 2, 1, 4, 4),
    (3, 3, 2, 5, 1),
    (3, 4, 3, 6, 5),
    (3, 5, 4, 7, 1),
    (3, 6, 5, 8, 2),
    (3, 1, 6, 9, 2),
    (3, 2, 7, 10, 1),
    (3, 3, 1, 1, 1),
    (3, 4, 2, 2, 3),
    (4, 5, 3, 3, 3),
    (4, 6, 4, 4, 2),
    (4, 1, 5, 5, 1),
    (4, 2, 6, 6, 3),
    (4, 3, 7, 7, 1),
    (4, 4, 1, 8, 6),
    (4, 5, 2, 9, 3),
    (4, 6, 3, 10, 1),
    (4, 1, 4, 3, 2);